GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_canfd.h
 /**   
  *******************************************************************************************************
  * @file    fm33fh0xx_fl_canfd.h
  * @author  FMSH Application Team
  * @brief   Head file of CANFD FL Module 
  *******************************************************************************************************   
  * @attention    
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *        
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *    
  * 1. Redistributions of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors 
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *    
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS “AS IS”
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE   
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT   
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */    

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FH0XX_FL_CANFD_H
#define __FM33FH0XX_FL_CANFD_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fh0xx_fl_def.h"
/** @addtogroup FM33FH0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup CANFD_FL_ES_INIT CANFD Exported Init structures
  * @{
  */

/**
  * @brief FL CANFD Init Sturcture definition
  */
    
extern const uint8_t RXMB_INDEX_START[4];
    
#define RXMB_NUM(x)     ((x) >> 3)
#define RXMB_INDEX(x)   ((x) - RXMB_INDEX_START[RXMB_NUM(x)])

typedef struct
{
    CANFD_RX_FIFO_Type         * RX_FIFO;
    CANFD_COMMON_FIFO_Type     * COMMON_FIFO;
    CANFD_TX_MESSAGE_Type      * TX_MESSAGE;
    CANFD_TX_HISTORY_LIST_Type * TX_HISTORY_LIST;
    CANFD_RX_MESSAGE_Type      * RX_MESSAGE[4];
}CANFD_BUFFER_TYPE;

extern const CANFD_BUFFER_TYPE CANFD_BUFFER[];

/*Buffer宏定义*/
#define THL(x)        (CANFD_BUFFER[0].TX_HISTORY_LIST)
#define CF(x)         (CANFD_BUFFER[0].COMMON_FIFO)
#define RM(x, num)    (CANFD_BUFFER[0].RX_MESSAGE[RXMB_NUM(num)]->CFDRM[RXMB_INDEX(num)])
#define RF(x, num)    (CANFD_BUFFER[0].RX_FIFO->CFDRF[num])
#define TM(x, num)    (CANFD_BUFFER[0].TX_MESSAGE->CFDTM[num])

/*RxMB配置*/
typedef struct
{
    /*RxMB负载大小配置*/
    uint32_t payloadDataSize;    
    /*RxMB数目*/
    uint32_t rxmbNum;    
}FL_CANFD_RxMB_CfgTypeDef;

/*RxFIFO配置*/
typedef struct
{
    /*中断产生水位*/
    uint32_t intGenCounterValue;
    /*中断模式*/
    uint32_t intMode;
    /*FIFO深度*/
    uint32_t fifoDepth;    
    /*负载大小配置*/
    uint32_t payloadDataSize;
    /*中断使能*/
    FL_FunState intEnable;
    /*CommonFIFO是否使能*/
    FL_FunState Enable;    
}FL_CANFD_RxFIFO_CfgTypeDef;

/*CommonFIFO配置*/
typedef struct
{
    /*发送间隔*/
    uint32_t txInterval;
    /*FIFO深度*/
    uint32_t fifoDepth;
    /*发送用TxMB链接*/
    uint32_t txmbLink;
    /*中断产生水位*/
    uint32_t intGenCounterValue;
    /*中断模式*/
    uint32_t intMode;
    /*内部定时器分辨率*/
    uint32_t intervalTimerResolution;
    /*内部定时器源*/
    uint32_t intervalTimerSource;
    /*FIFO模式*/
    uint32_t fifoMode;
    /*负载大小配置*/
    uint32_t payloadDataSize;
    /*中断使能*/
    FL_FunState intEnable;
    /*CommonFIFO是否使能*/
    FL_FunState Enable;   
}FL_CANFD_CommonFIFO_CfgTypeDef;

/*TxQueue配置*/
typedef struct
{
    /*队列深度*/
    uint32_t queueDepth;
    /*中断模式*/
    uint32_t intMode;
    /*中断使能*/
    FL_FunState intEnable;
    /*TxQueue是否使能*/
    FL_FunState Enable;   
}FL_CANFD_TxQueue_CfgTypeDef;

/*TxHistoryList配置*/
typedef struct
{
    /*TxHistoryList专用Tx是否使能*/
    FL_FunState dedicatedTxEnable;    
    /*中断模式*/
    uint32_t intMode;
    /*中断使能*/
    FL_FunState intEnable;
    /*TxHistoryList是否使能*/
    FL_FunState Enable;   
}FL_CANFD_TxHistoryList_CfgTypeDef;

/**
  * @brief  CANFD Acceptance filter config structure definition
  */
typedef struct
{
    /*IDE*/
    uint32_t filterIDE;
    /*RTR*/
    uint32_t filterRTR;
    /*ID*/
    uint32_t filterID;
    
    /*IDEM*/
    uint32_t filterIDEMask;
    /*RTRM*/
    uint32_t filterRTRMask;
    /*IDM*/
    uint32_t filterIDMask;
    
    /*RxMB配置*/
    /*RxMB有效使能*/
    uint32_t rxmbValid;    
    /*接收用RxMB编号*/
    uint32_t rxmbNum;
    /*接收长度*/
    uint32_t dlc;
    
    /*CommonFIFO和RxFIFO接收使能*/
    /*CommonFIFO接收使能*/
    FL_FunState commonfifoRecvEnable;
    /*RxFIFO接收使能*/
    FL_FunState rxfifo0RecvEnable;
    FL_FunState rxfifo1RecvEnable;

    /*滤波器使能*/
    FL_FunState  filterEnable;
} FL_CANFD_AcceptanceFilter_CfgTypeDef;

/**
  * @brief FL CANFD Init Sturcture definition
  */
typedef struct
{
    /*全局模式*/
    uint32_t globalMode;
    /*通道模式*/
    uint32_t channelMode;
    
    /*标称位速率同步段长度*/
    uint32_t NB_SJW;
    /*标称位速率时间段1*/
    uint32_t NB_TS1;
    /*标称位速率时间段2*/
    uint32_t NB_TS2;
    /*标称位速率波特率预分频*/
    uint32_t NB_BRP;
    /*数据位速率同步段长度*/
    uint32_t DB_SJW;
    /*数据位速率时间段1*/
    uint32_t DB_TS1;
    /*数据位速率时间段2*/
    uint32_t DB_TS2;
    /*数据位速率波特率预分频*/
    uint32_t DB_BRP;
      
    /*通信时钟源选择*/
    uint32_t clockSource;
    /*RAM时钟源选择*/
    uint32_t clockSourceRAM;
    
    /*接收和发送Buffer配置*/
    FL_CANFD_RxMB_CfgTypeDef   rxmbCfg;
    FL_CANFD_RxFIFO_CfgTypeDef rxfifoCfg[2];
    FL_CANFD_CommonFIFO_CfgTypeDef commonfifoCfg;
    FL_CANFD_TxQueue_CfgTypeDef  txqueueCfg;    
    FL_CANFD_TxHistoryList_CfgTypeDef txHistoryCfg;
    
    /*接收滤波器配置*/
    /*接收滤波器规则数目*/
    uint32_t acceptanceFilterRuleNum;
    FL_CANFD_AcceptanceFilter_CfgTypeDef acceptanceFilterCfg[32];
    
    /*特殊参数配置*/
    /*发送优先级选择*/
    uint32_t txPriority;
    /*ESI配置*/
    uint32_t esiCfg;
    /*发送延迟补偿偏置*/
    uint32_t tdco;
    /*发送延迟补偿配置*/
    uint32_t tdcoCfg;    
    /*发送延迟补偿使能*/
    FL_FunState tdcoEnable;
    
    /*RES位协议异常检测使能 */
    FL_FunState respedEnable;
    /*DLC检查使能*/
    FL_FunState dlcCheckEnable;
    /*DLC替换使能 */
    FL_FunState dlcReplacementEnable;
    /*消息过载拒接接收使能*/
    FL_FunState messageIsRejected;
} FL_CANFD_InitTypeDef;
    
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup CANFD_FL_Exported_Constants CANFD Exported Constants
  * @{
  */

