GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_canfd.h
#define    CANFD_CFDC0NCFG_NTSEG2_Pos                             (25U)
#define    CANFD_CFDC0NCFG_NTSEG2_Msk                             (0x7fU << CANFD_CFDC0NCFG_NTSEG2_Pos)
#define    CANFD_CFDC0NCFG_NTSEG2                                 CANFD_CFDC0NCFG_NTSEG2_Msk

#define    CANFD_CFDC0NCFG_NTSEG1_Pos                             (17U)
#define    CANFD_CFDC0NCFG_NTSEG1_Msk                             (0xffU << CANFD_CFDC0NCFG_NTSEG1_Pos)
#define    CANFD_CFDC0NCFG_NTSEG1                                 CANFD_CFDC0NCFG_NTSEG1_Msk

#define    CANFD_CFDC0NCFG_NSJW_Pos                               (10U)
#define    CANFD_CFDC0NCFG_NSJW_Msk                               (0x7fU << CANFD_CFDC0NCFG_NSJW_Pos)
#define    CANFD_CFDC0NCFG_NSJW                                   CANFD_CFDC0NCFG_NSJW_Msk

#define    CANFD_CFDC0NCFG_NBRP_Pos                               (0U)
#define    CANFD_CFDC0NCFG_NBRP_Msk                               (0x3ffU << CANFD_CFDC0NCFG_NBRP_Pos)
#define    CANFD_CFDC0NCFG_NBRP                                   CANFD_CFDC0NCFG_NBRP_Msk

#define    CANFD_CFDC0CTR_ROM_Pos                                 (31U)
#define    CANFD_CFDC0CTR_ROM_Msk                                 (0x1U << CANFD_CFDC0CTR_ROM_Pos)
#define    CANFD_CFDC0CTR_ROM                                     CANFD_CFDC0CTR_ROM_Msk

#define    CANFD_CFDC0CTR_BFT_Pos                                 (30U)
#define    CANFD_CFDC0CTR_BFT_Msk                                 (0x1U << CANFD_CFDC0CTR_BFT_Pos)
#define    CANFD_CFDC0CTR_BFT                                     CANFD_CFDC0CTR_BFT_Msk

#define    CANFD_CFDC0CTR_CTMS_Pos                                (25U)
#define    CANFD_CFDC0CTR_CTMS_Msk                                (0x3U << CANFD_CFDC0CTR_CTMS_Pos)
#define    CANFD_CFDC0CTR_CTMS                                    CANFD_CFDC0CTR_CTMS_Msk

#define    CANFD_CFDC0CTR_CTME_Pos                                (24U)
#define    CANFD_CFDC0CTR_CTME_Msk                                (0x1U << CANFD_CFDC0CTR_CTME_Pos)
#define    CANFD_CFDC0CTR_CTME                                    CANFD_CFDC0CTR_CTME_Msk

#define    CANFD_CFDC0CTR_ERRD_Pos                                (23U)
#define    CANFD_CFDC0CTR_ERRD_Msk                                (0x1U << CANFD_CFDC0CTR_ERRD_Pos)
#define    CANFD_CFDC0CTR_ERRD                                    CANFD_CFDC0CTR_ERRD_Msk

#define    CANFD_CFDC0CTR_BOM_Pos                                 (21U)
#define    CANFD_CFDC0CTR_BOM_Msk                                 (0x3U << CANFD_CFDC0CTR_BOM_Pos)
#define    CANFD_CFDC0CTR_BOM                                     CANFD_CFDC0CTR_BOM_Msk

#define    CANFD_CFDC0CTR_TDCVFIE_Pos                             (19U)
#define    CANFD_CFDC0CTR_TDCVFIE_Msk                             (0x1U << CANFD_CFDC0CTR_TDCVFIE_Pos)
#define    CANFD_CFDC0CTR_TDCVFIE                                 CANFD_CFDC0CTR_TDCVFIE_Msk

#define    CANFD_CFDC0CTR_SOCOIE_Pos                              (18U)
#define    CANFD_CFDC0CTR_SOCOIE_Msk                              (0x1U << CANFD_CFDC0CTR_SOCOIE_Pos)
#define    CANFD_CFDC0CTR_SOCOIE                                  CANFD_CFDC0CTR_SOCOIE_Msk

#define    CANFD_CFDC0CTR_EOCOIE_Pos                              (17U)
#define    CANFD_CFDC0CTR_EOCOIE_Msk                              (0x1U << CANFD_CFDC0CTR_EOCOIE_Pos)
#define    CANFD_CFDC0CTR_EOCOIE                                  CANFD_CFDC0CTR_EOCOIE_Msk

#define    CANFD_CFDC0CTR_TAIE_Pos                                (16U)
#define    CANFD_CFDC0CTR_TAIE_Msk                                (0x1U << CANFD_CFDC0CTR_TAIE_Pos)
#define    CANFD_CFDC0CTR_TAIE                                    CANFD_CFDC0CTR_TAIE_Msk

#define    CANFD_CFDC0CTR_ALIE_Pos                                (15U)
#define    CANFD_CFDC0CTR_ALIE_Msk                                (0x1U << CANFD_CFDC0CTR_ALIE_Pos)
#define    CANFD_CFDC0CTR_ALIE                                    CANFD_CFDC0CTR_ALIE_Msk

#define    CANFD_CFDC0CTR_BLIE_Pos                                (14U)
#define    CANFD_CFDC0CTR_BLIE_Msk                                (0x1U << CANFD_CFDC0CTR_BLIE_Pos)
#define    CANFD_CFDC0CTR_BLIE                                    CANFD_CFDC0CTR_BLIE_Msk

#define    CANFD_CFDC0CTR_OLIE_Pos                                (13U)
#define    CANFD_CFDC0CTR_OLIE_Msk                                (0x1U << CANFD_CFDC0CTR_OLIE_Pos)
#define    CANFD_CFDC0CTR_OLIE                                    CANFD_CFDC0CTR_OLIE_Msk

#define    CANFD_CFDC0CTR_BORIE_Pos                               (12U)
#define    CANFD_CFDC0CTR_BORIE_Msk                               (0x1U << CANFD_CFDC0CTR_BORIE_Pos)
#define    CANFD_CFDC0CTR_BORIE                                   CANFD_CFDC0CTR_BORIE_Msk

#define    CANFD_CFDC0CTR_BOEIE_Pos                               (11U)
#define    CANFD_CFDC0CTR_BOEIE_Msk                               (0x1U << CANFD_CFDC0CTR_BOEIE_Pos)
#define    CANFD_CFDC0CTR_BOEIE                                   CANFD_CFDC0CTR_BOEIE_Msk

#define    CANFD_CFDC0CTR_EPIE_Pos                                (10U)
#define    CANFD_CFDC0CTR_EPIE_Msk                                (0x1U << CANFD_CFDC0CTR_EPIE_Pos)
#define    CANFD_CFDC0CTR_EPIE                                    CANFD_CFDC0CTR_EPIE_Msk

#define    CANFD_CFDC0CTR_EWIE_Pos                                (9U)
#define    CANFD_CFDC0CTR_EWIE_Msk                                (0x1U << CANFD_CFDC0CTR_EWIE_Pos)
#define    CANFD_CFDC0CTR_EWIE                                    CANFD_CFDC0CTR_EWIE_Msk

#define    CANFD_CFDC0CTR_BEIE_Pos                                (8U)
#define    CANFD_CFDC0CTR_BEIE_Msk                                (0x1U << CANFD_CFDC0CTR_BEIE_Pos)
#define    CANFD_CFDC0CTR_BEIE                                    CANFD_CFDC0CTR_BEIE_Msk

#define    CANFD_CFDC0CTR_RTBO_Pos                                (3U)
#define    CANFD_CFDC0CTR_RTBO_Msk                                (0x1U << CANFD_CFDC0CTR_RTBO_Pos)
#define    CANFD_CFDC0CTR_RTBO                                    CANFD_CFDC0CTR_RTBO_Msk

