GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_canfd.h
#define    CANFD_CFDC0CTR_CSLPR_Pos                               (2U)
#define    CANFD_CFDC0CTR_CSLPR_Msk                               (0x1U << CANFD_CFDC0CTR_CSLPR_Pos)
#define    CANFD_CFDC0CTR_CSLPR                                   CANFD_CFDC0CTR_CSLPR_Msk

#define    CANFD_CFDC0CTR_CHMDC_Pos                               (0U)
#define    CANFD_CFDC0CTR_CHMDC_Msk                               (0x3U << CANFD_CFDC0CTR_CHMDC_Pos)
#define    CANFD_CFDC0CTR_CHMDC                                   CANFD_CFDC0CTR_CHMDC_Msk

#define    CANFD_CFDC0STS_TEC_Pos                                 (24U)
#define    CANFD_CFDC0STS_TEC_Msk                                 (0xffU << CANFD_CFDC0STS_TEC_Pos)
#define    CANFD_CFDC0STS_TEC                                     CANFD_CFDC0STS_TEC_Msk

#define    CANFD_CFDC0STS_REC_Pos                                 (16U)
#define    CANFD_CFDC0STS_REC_Msk                                 (0xffU << CANFD_CFDC0STS_REC_Pos)
#define    CANFD_CFDC0STS_REC                                     CANFD_CFDC0STS_REC_Msk

#define    CANFD_CFDC0STS_ESIF_Pos                                (8U)
#define    CANFD_CFDC0STS_ESIF_Msk                                (0x1U << CANFD_CFDC0STS_ESIF_Pos)
#define    CANFD_CFDC0STS_ESIF                                    CANFD_CFDC0STS_ESIF_Msk

#define    CANFD_CFDC0STS_COMSTS_Pos                              (7U)
#define    CANFD_CFDC0STS_COMSTS_Msk                              (0x1U << CANFD_CFDC0STS_COMSTS_Pos)
#define    CANFD_CFDC0STS_COMSTS                                  CANFD_CFDC0STS_COMSTS_Msk

#define    CANFD_CFDC0STS_RECSTS_Pos                              (6U)
#define    CANFD_CFDC0STS_RECSTS_Msk                              (0x1U << CANFD_CFDC0STS_RECSTS_Pos)
#define    CANFD_CFDC0STS_RECSTS                                  CANFD_CFDC0STS_RECSTS_Msk

#define    CANFD_CFDC0STS_TRMSTS_Pos                              (5U)
#define    CANFD_CFDC0STS_TRMSTS_Msk                              (0x1U << CANFD_CFDC0STS_TRMSTS_Pos)
#define    CANFD_CFDC0STS_TRMSTS                                  CANFD_CFDC0STS_TRMSTS_Msk

#define    CANFD_CFDC0STS_BOSTS_Pos                               (4U)
#define    CANFD_CFDC0STS_BOSTS_Msk                               (0x1U << CANFD_CFDC0STS_BOSTS_Pos)
#define    CANFD_CFDC0STS_BOSTS                                   CANFD_CFDC0STS_BOSTS_Msk

#define    CANFD_CFDC0STS_EPSTS_Pos                               (3U)
#define    CANFD_CFDC0STS_EPSTS_Msk                               (0x1U << CANFD_CFDC0STS_EPSTS_Pos)
#define    CANFD_CFDC0STS_EPSTS                                   CANFD_CFDC0STS_EPSTS_Msk

#define    CANFD_CFDC0STS_CSLPSTS_Pos                             (2U)
#define    CANFD_CFDC0STS_CSLPSTS_Msk                             (0x1U << CANFD_CFDC0STS_CSLPSTS_Pos)
#define    CANFD_CFDC0STS_CSLPSTS                                 CANFD_CFDC0STS_CSLPSTS_Msk

#define    CANFD_CFDC0STS_CHLTSTS_Pos                             (1U)
#define    CANFD_CFDC0STS_CHLTSTS_Msk                             (0x1U << CANFD_CFDC0STS_CHLTSTS_Pos)
#define    CANFD_CFDC0STS_CHLTSTS                                 CANFD_CFDC0STS_CHLTSTS_Msk

#define    CANFD_CFDC0STS_CRSTSTS_Pos                             (0U)
#define    CANFD_CFDC0STS_CRSTSTS_Msk                             (0x1U << CANFD_CFDC0STS_CRSTSTS_Pos)
#define    CANFD_CFDC0STS_CRSTSTS                                 CANFD_CFDC0STS_CRSTSTS_Msk

#define    CANFD_CFDC0ERFL_CRCREG_Pos                             (16U)
#define    CANFD_CFDC0ERFL_CRCREG_Msk                             (0x7fffU << CANFD_CFDC0ERFL_CRCREG_Pos)
#define    CANFD_CFDC0ERFL_CRCREG                                 CANFD_CFDC0ERFL_CRCREG_Msk

#define    CANFD_CFDC0ERFL_ADERR_Pos                              (14U)
#define    CANFD_CFDC0ERFL_ADERR_Msk                              (0x1U << CANFD_CFDC0ERFL_ADERR_Pos)
#define    CANFD_CFDC0ERFL_ADERR                                  CANFD_CFDC0ERFL_ADERR_Msk

#define    CANFD_CFDC0ERFL_B0ERR_Pos                              (13U)
#define    CANFD_CFDC0ERFL_B0ERR_Msk                              (0x1U << CANFD_CFDC0ERFL_B0ERR_Pos)
#define    CANFD_CFDC0ERFL_B0ERR                                  CANFD_CFDC0ERFL_B0ERR_Msk

#define    CANFD_CFDC0ERFL_B1ERR_Pos                              (12U)
#define    CANFD_CFDC0ERFL_B1ERR_Msk                              (0x1U << CANFD_CFDC0ERFL_B1ERR_Pos)
#define    CANFD_CFDC0ERFL_B1ERR                                  CANFD_CFDC0ERFL_B1ERR_Msk

#define    CANFD_CFDC0ERFL_CERR_Pos                               (11U)
#define    CANFD_CFDC0ERFL_CERR_Msk                               (0x1U << CANFD_CFDC0ERFL_CERR_Pos)
#define    CANFD_CFDC0ERFL_CERR                                   CANFD_CFDC0ERFL_CERR_Msk

#define    CANFD_CFDC0ERFL_AERR_Pos                               (10U)
#define    CANFD_CFDC0ERFL_AERR_Msk                               (0x1U << CANFD_CFDC0ERFL_AERR_Pos)
#define    CANFD_CFDC0ERFL_AERR                                   CANFD_CFDC0ERFL_AERR_Msk

#define    CANFD_CFDC0ERFL_FERR_Pos                               (9U)
#define    CANFD_CFDC0ERFL_FERR_Msk                               (0x1U << CANFD_CFDC0ERFL_FERR_Pos)
#define    CANFD_CFDC0ERFL_FERR                                   CANFD_CFDC0ERFL_FERR_Msk

#define    CANFD_CFDC0ERFL_SERR_Pos                               (8U)
#define    CANFD_CFDC0ERFL_SERR_Msk                               (0x1U << CANFD_CFDC0ERFL_SERR_Pos)
#define    CANFD_CFDC0ERFL_SERR                                   CANFD_CFDC0ERFL_SERR_Msk

#define    CANFD_CFDC0ERFL_ALF_Pos                                (7U)
#define    CANFD_CFDC0ERFL_ALF_Msk                                (0x1U << CANFD_CFDC0ERFL_ALF_Pos)
#define    CANFD_CFDC0ERFL_ALF                                    CANFD_CFDC0ERFL_ALF_Msk

#define    CANFD_CFDC0ERFL_BLF_Pos                                (6U)
#define    CANFD_CFDC0ERFL_BLF_Msk                                (0x1U << CANFD_CFDC0ERFL_BLF_Pos)
#define    CANFD_CFDC0ERFL_BLF                                    CANFD_CFDC0ERFL_BLF_Msk

#define    CANFD_CFDC0ERFL_OVLF_Pos                               (5U)
#define    CANFD_CFDC0ERFL_OVLF_Msk                               (0x1U << CANFD_CFDC0ERFL_OVLF_Pos)
#define    CANFD_CFDC0ERFL_OVLF                                   CANFD_CFDC0ERFL_OVLF_Msk

#define    CANFD_CFDC0ERFL_BORF_Pos                               (4U)
#define    CANFD_CFDC0ERFL_BORF_Msk                               (0x1U << CANFD_CFDC0ERFL_BORF_Pos)
#define    CANFD_CFDC0ERFL_BORF                                   CANFD_CFDC0ERFL_BORF_Msk

