GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_canfd.h
/**
  * @brief    Set Channel 0 Data Bitrate Resynchronization jump width
  * @rmtoll   CFDC0DCFG    DSJW    FL_CANFD_CH0_WriteDataBitrateSyncJumpWidth
  * @param    CANFDx CANFD instance
  * @param    width 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_WriteDataBitrateSyncJumpWidth(CANFD_COMMON_Type* CANFDx, uint32_t width)
{
    MODIFY_REG(CANFDx->CFDC0DCFG, (0xfU << 24U), (width << 24U));
}

/**
  * @brief    Get Channel 0 Data Bitrate Resynchronization jump width
  * @rmtoll   CFDC0DCFG    DSJW    FL_CANFD_CH0_ReadDataBitrateSyncJumpWidth
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadDataBitrateSyncJumpWidth(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0DCFG, (0xfU << 24U)) >> 24U);
}

/**
  * @brief    Set Channel 0 Data Bitrate Timing segment 2
  * @rmtoll   CFDC0DCFG    DTSEG2    FL_CANFD_CH0_WriteDataBitrateTimeSegment2Length
  * @param    CANFDx CANFD instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_WriteDataBitrateTimeSegment2Length(CANFD_COMMON_Type* CANFDx, uint32_t length)
{
    MODIFY_REG(CANFDx->CFDC0DCFG, (0xfU << 16U), (length << 16U));
}

/**
  * @brief    Get Channel 0 Data Bitrate Timing segment 2
  * @rmtoll   CFDC0DCFG    DTSEG2    FL_CANFD_CH0_ReadDataBitrateTimeSegment2Length
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadDataBitrateTimeSegment2Length(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0DCFG, (0xfU << 16U)) >> 16U);
}

/**
  * @brief    Set Channel 0 Data Bitrate Timing segment 1
  * @rmtoll   CFDC0DCFG    DTSEG1    FL_CANFD_CH0_WriteDataBitrateTimeSegment1Length
  * @param    CANFDx CANFD instance
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_WriteDataBitrateTimeSegment1Length(CANFD_COMMON_Type* CANFDx, uint32_t length)
{
    MODIFY_REG(CANFDx->CFDC0DCFG, (0x1fU << 8U), (length << 8U));
}

/**
  * @brief    Get Channel 0 Data Bitrate Timing segment 1
  * @rmtoll   CFDC0DCFG    DTSEG1    FL_CANFD_CH0_ReadDataBitrateTimeSegment1Length
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadDataBitrateTimeSegment1Length(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0DCFG, (0x1fU << 8U)) >> 8U);
}

/**
  * @brief    Set Channel 0 Data Bitrate prescaler
  * @rmtoll   CFDC0DCFG    DBRP    FL_CANFD_CH0_WriteDataBitratePrescaler
  * @param    CANFDx CANFD instance
  * @param    psc 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_WriteDataBitratePrescaler(CANFD_COMMON_Type* CANFDx, uint32_t psc)
{
    MODIFY_REG(CANFDx->CFDC0DCFG, (0xffU << 0U), (psc << 0U));
}

/**
  * @brief    Get Channel 0 Data Bitrate prescaler
  * @rmtoll   CFDC0DCFG    DBRP    FL_CANFD_CH0_ReadDataBitratePrescaler
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_ReadDataBitratePrescaler(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0DCFG, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Channel 0 Classical CAN only enable
  * @rmtoll   CFDC0FDCFG    CLOE    FL_CANFD_CH0_FD_Enable_ClassicalCANOnly
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Enable_ClassicalCANOnly(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_CLOE_Msk);
}

/**
  * @brief    Channel 0 Classical CAN only disable 
  * @rmtoll   CFDC0FDCFG    CLOE    FL_CANFD_CH0_FD_Disable_ClassicalCANOnly
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Disable_ClassicalCANOnly(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_CLOE_Msk);
}

/**
  * @brief    Channel 0 Get Classical CAN only enable status
  * @rmtoll   CFDC0FDCFG    CLOE    FL_CANFD_CH0_FD_IsEnabled_ClassicalCANOnly
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_IsEnabled_ClassicalCANOnly(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_CLOE_Msk) == CANFD_CFDC0FDCFG_CLOE_Msk);
}

/**
  * @brief    Channel 0 RX edge filter enable
  * @rmtoll   CFDC0FDCFG    REFE    FL_CANFD_CH0_FD_Enable_RxEdgeFilter
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Enable_RxEdgeFilter(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_REFE_Msk);
}

/**
  * @brief    Channel 0 RX edge filter disable 
  * @rmtoll   CFDC0FDCFG    REFE    FL_CANFD_CH0_FD_Disable_RxEdgeFilter
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Disable_RxEdgeFilter(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_REFE_Msk);
}

/**
  * @brief    Channel 0 Get RX edge filter enable status
  * @rmtoll   CFDC0FDCFG    REFE    FL_CANFD_CH0_FD_IsEnabled_RxEdgeFilter
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_IsEnabled_RxEdgeFilter(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_REFE_Msk) == CANFD_CFDC0FDCFG_REFE_Msk);
}

/**
  * @brief    Channel 0 FD only enable
  * @rmtoll   CFDC0FDCFG    FDOE    FL_CANFD_CH0_FD_Enable_FDOnly
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Enable_FDOnly(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_FDOE_Msk);
}

/**
  * @brief    Channel 0 FD only disable 
  * @rmtoll   CFDC0FDCFG    FDOE    FL_CANFD_CH0_FD_Disable_FDOnly
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Disable_FDOnly(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_FDOE_Msk);
}

/**
  * @brief    Channel 0 FD only enable status
  * @rmtoll   CFDC0FDCFG    FDOE    FL_CANFD_CH0_FD_IsEnabled_FDOnly
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_IsEnabled_FDOnly(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_FDOE_Msk) == CANFD_CFDC0FDCFG_FDOE_Msk);
}

/**
  * @brief    Set Channel 0 Transceiver Delay Compensation Offset
  * @rmtoll   CFDC0FDCFG    TDCO    FL_CANFD_CH0_FD_Write_TransceiverDelayCompensationOffset
  * @param    CANFDx CANFD instance
  * @param    width 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Write_TransceiverDelayCompensationOffset(CANFD_COMMON_Type* CANFDx, uint32_t width)
{
    MODIFY_REG(CANFDx->CFDC0FDCFG, (0xffU << 16U), (width << 16U));
}

/**
  * @brief    Get Channel 0 Transceiver Delay Compensation Offset
  * @rmtoll   CFDC0FDCFG    TDCO    FL_CANFD_CH0_FD_Read_TransceiverDelayCompensationOffset
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_Read_TransceiverDelayCompensationOffset(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, (0xffU << 16U)) >> 16U);
}

/**
  * @brief    Set Channel 0 Return Pretended Network Filter Mode
  * @rmtoll   CFDC0FDCFG    RPNMD    FL_CANFD_CH0_FD_SetReturnPNFMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RETURN_PNF_MODE_AF
  *           @arg @ref FL_CANFD_RETURN_PNF_MODE_PNFID_AF
  *           @arg @ref FL_CANFD_RETURN_PNF_MODE_PNF_AF
  *           @arg @ref FL_CANFD_RETURN_PNF_MODE_PNF
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_SetReturnPNFMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_RPNMD_Msk, mode);
}

/**
  * @brief    Get Channel 0 Return Pretended Network Filter Mode
  * @rmtoll   CFDC0FDCFG    RPNMD    FL_CANFD_CH0_FD_GetReturnPNFMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RETURN_PNF_MODE_AF
  *           @arg @ref FL_CANFD_RETURN_PNF_MODE_PNFID_AF
  *           @arg @ref FL_CANFD_RETURN_PNF_MODE_PNF_AF
  *           @arg @ref FL_CANFD_RETURN_PNF_MODE_PNF
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_GetReturnPNFMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_RPNMD_Msk));
}

/**
  * @brief    Set Channel 0 Error State Indication Configuration
  * @rmtoll   CFDC0FDCFG    ESIC    FL_CANFD_CH0_FD_SetErrorStateIndicationConfiguration
  * @param    CANFDx CANFD instance
  * @param    configuration This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_ESI_CONFIGURATION_NODE_STATE
  *           @arg @ref FL_CANFD_ESI_CONFIGURATION_SOFTWARE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_SetErrorStateIndicationConfiguration(CANFD_COMMON_Type* CANFDx, uint32_t configuration)
{
    MODIFY_REG(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_ESIC_Msk, configuration);
}

/**
  * @brief    Get Channel 0 Error State Indication Configuration
  * @rmtoll   CFDC0FDCFG    ESIC    FL_CANFD_CH0_FD_GetErrorStateIndicationConfiguration
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_ESI_CONFIGURATION_NODE_STATE
  *           @arg @ref FL_CANFD_ESI_CONFIGURATION_SOFTWARE
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_GetErrorStateIndicationConfiguration(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_ESIC_Msk));
}

/**
  * @brief    Channel 0 Transceiver Delay Compensation Enable
  * @rmtoll   CFDC0FDCFG    TDCE    FL_CANFD_CH0_FD_Enable_TransceiverDelayCompensation
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Enable_TransceiverDelayCompensation(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_TDCE_Msk);
}

/**
  * @brief    Channel 0 Transceiver Delay Compensation disable 
  * @rmtoll   CFDC0FDCFG    TDCE    FL_CANFD_CH0_FD_Disable_TransceiverDelayCompensation
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Disable_TransceiverDelayCompensation(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_TDCE_Msk);
}

/**
  * @brief    Channel 0 Transceiver Delay Compensation enable status
  * @rmtoll   CFDC0FDCFG    TDCE    FL_CANFD_CH0_FD_IsEnabled_TransceiverDelayCompensation
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_IsEnabled_TransceiverDelayCompensation(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_TDCE_Msk) == CANFD_CFDC0FDCFG_TDCE_Msk);
}

/**
  * @brief    Set Channel 0 Transceiver Delay Compensation Offset Configuration
  * @rmtoll   CFDC0FDCFG    TDCOC    FL_CANFD_CH0_FD_SetTransceiverDelayCompensationOffsetConfiguration
  * @param    CANFDx CANFD instance
  * @param    configuration This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TDCO_CONFIGURATION_MEASURED_WITH_OFFSET
  *           @arg @ref FL_CANFD_TDCO_CONFIGURATION_OFFSET
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_SetTransceiverDelayCompensationOffsetConfiguration(CANFD_COMMON_Type* CANFDx, uint32_t configuration)
{
    MODIFY_REG(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_TDCOC_Msk, configuration);
}

/**
  * @brief    Get Channel 0 Transceiver Delay Compensation Offset Configuration
  * @rmtoll   CFDC0FDCFG    TDCOC    FL_CANFD_CH0_FD_GetTransceiverDelayCompensationOffsetConfiguration
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TDCO_CONFIGURATION_MEASURED_WITH_OFFSET
  *           @arg @ref FL_CANFD_TDCO_CONFIGURATION_OFFSET
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_GetTransceiverDelayCompensationOffsetConfiguration(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_TDCOC_Msk));
}

/**
  * @brief    Set Channel 0 Error Occurrence Counter Configuration
  * @rmtoll   CFDC0FDCFG    EOCCFG    FL_CANFD_CH0_FD_SetErrorOccurrenceCounterConfiguration
  * @param    CANFDx CANFD instance
  * @param    configuration This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_ALL
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_TRANSMITTER
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_RECEIVER
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_ALL_FD_DATAPHASE
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_TRANSMITTER_FD_DATAPHASE
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_RECEIVER_FD_DATAPHASE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_SetErrorOccurrenceCounterConfiguration(CANFD_COMMON_Type* CANFDx, uint32_t configuration)
{
    MODIFY_REG(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_EOCCFG_Msk, configuration);
}

/**
  * @brief    Get Channel 0 Error Occurrence Counter Configuration
  * @rmtoll   CFDC0FDCFG    EOCCFG    FL_CANFD_CH0_FD_GetErrorOccurrenceCounterConfiguration
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_ALL
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_TRANSMITTER
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_RECEIVER
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_ALL_FD_DATAPHASE
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_TRANSMITTER_FD_DATAPHASE
  *           @arg @ref FL_CANFD_EOC_CONFIGURATION_RECEIVER_FD_DATAPHASE
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_GetErrorOccurrenceCounterConfiguration(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCFG, CANFD_CFDC0FDCFG_EOCCFG_Msk));
}

/**
  * @brief    Set Channel 0 Key to rewrite PNMDC bit
  * @rmtoll   CFDC0FDCTR    KEY    FL_CANFD_CH0_FD_WriteKeyOfPNMDC
  * @param    CANFDx CANFD instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_WriteKeyOfPNMDC(CANFD_COMMON_Type* CANFDx, uint32_t key)
{
    MODIFY_REG(CANFDx->CFDC0FDCTR, (0xffU << 24U), (key << 24U));
}

/**
  * @brief    Get Channel 0 Key to rewrite PNMDC bit
  * @rmtoll   CFDC0FDCTR    KEY    FL_CANFD_CH0_FD_ReadKeyOfPNMDC
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_ReadKeyOfPNMDC(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCTR, (0xffU << 24U)) >> 24U);
}

/**
  * @brief    Set Channel 0 Pretended Network Filter Mode
  * @rmtoll   CFDC0FDCTR    PNMDC    FL_CANFD_CH0_FD_SetPNFMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PNF_MODE_AF
  *           @arg @ref FL_CANFD_PNF_MODE_PNFID_AF
  *           @arg @ref FL_CANFD_PNF_MODE_PNF_AF
  *           @arg @ref FL_CANFD_PNF_MODE_PNF
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_SetPNFMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDC0FDCTR, CANFD_CFDC0FDCTR_PNMDC_Msk, mode);
}

/**
  * @brief    Get Channel 0 Pretended Network Filter Mode
  * @rmtoll   CFDC0FDCTR    PNMDC    FL_CANFD_CH0_FD_GetPNFMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_PNF_MODE_AF
  *           @arg @ref FL_CANFD_PNF_MODE_PNFID_AF
  *           @arg @ref FL_CANFD_PNF_MODE_PNF_AF
  *           @arg @ref FL_CANFD_PNF_MODE_PNF
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_GetPNFMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCTR, CANFD_CFDC0FDCTR_PNMDC_Msk));
}

/**
  * @brief    Channel 0 Successful Occurrence Counter Clear enable
  * @rmtoll   CFDC0FDCTR    SOCCLR    FL_CANFD_CH0_FD_Enable_SuccessfulOccurrenceCounterClear
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Enable_SuccessfulOccurrenceCounterClear(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0FDCTR, CANFD_CFDC0FDCTR_SOCCLR_Msk);
}

/**
  * @brief    Channel 0 Error Occurrence Counter Clear enable
  * @rmtoll   CFDC0FDCTR    EOCCLR    FL_CANFD_CH0_FD_Enable_ErrorOccurrenceCounterClear
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_Enable_ErrorOccurrenceCounterClear(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDC0FDCTR, CANFD_CFDC0FDCTR_EOCCLR_Msk);
}

/**
  * @brief    Get Channel 0 Successful occurrence counter
  * @rmtoll   CFDC0FDSTS    SOC    FL_CANFD_CH0_FD_ReadSuccessfulOccurrenceCounter
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_ReadSuccessfulOccurrenceCounter(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDSTS, (0xffU << 24U)) >> 24U);
}

/**
  * @brief    Get Channel 0 Error occurrence counter
  * @rmtoll   CFDC0FDSTS    EOC    FL_CANFD_CH0_FD_ReadErrorOccurrenceCounter
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_ReadErrorOccurrenceCounter(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDSTS, (0xffU << 16U)) >> 16U);
}

/**
  * @brief    Get Channel 0 Transceiver Delay Compensation Violation Flag
  * @rmtoll   CFDC0FDSTS    TDCVF    FL_CANFD_CH0_FD_IsActiveFlag_TransceiverDelayCompensationViolation
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_IsActiveFlag_TransceiverDelayCompensationViolation(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDSTS, CANFD_CFDC0FDSTS_TDCVF_Msk) == (CANFD_CFDC0FDSTS_TDCVF_Msk));
}

/**
  * @brief    Clear Channel 0 Transceiver Delay Compensation Violation Flag
  * @rmtoll   CFDC0FDSTS    TDCVF    FL_CANFD_CH0_FD_ClearFlag_TransceiverDelayCompensationViolation
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_ClearFlag_TransceiverDelayCompensationViolation(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0FDSTS, CANFD_CFDC0FDSTS_TDCVF_Msk);
}

/**
  * @brief    Get Channel 0 Pretended Network Filter State
  * @rmtoll   CFDC0FDSTS    PNSTS    FL_CANFD_CH0_FD_GetPNFState
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_PNF_STATE_AF
  *           @arg @ref FL_CANFD_PNF_STATE_PNFID_AF
  *           @arg @ref FL_CANFD_PNF_STATE_PNF_AF
  *           @arg @ref FL_CANFD_PNF_STATE_PNF
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_GetPNFState(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDSTS, CANFD_CFDC0FDSTS_PNSTS_Msk));
}

/**
  * @brief    Get Channel 0 Successful occurrence counter overflow flag
  * @rmtoll   CFDC0FDSTS    SOCO    FL_CANFD_CH0_FD_IsActiveFlag_SuccessfulOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_IsActiveFlag_SuccessfulOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDSTS, CANFD_CFDC0FDSTS_SOCO_Msk) == (CANFD_CFDC0FDSTS_SOCO_Msk));
}

/**
  * @brief    Clear Channel 0 Successful occurrence counter overflow flag
  * @rmtoll   CFDC0FDSTS    SOCO    FL_CANFD_CH0_FD_ClearFlag_SuccessfulOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_ClearFlag_SuccessfulOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0FDSTS, CANFD_CFDC0FDSTS_SOCO_Msk);
}

/**
  * @brief    Get Channel 0 Error occurrence counter overflow flag
  * @rmtoll   CFDC0FDSTS    EOCO    FL_CANFD_CH0_FD_IsActiveFlag_ErrorOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_IsActiveFlag_ErrorOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDSTS, CANFD_CFDC0FDSTS_EOCO_Msk) == (CANFD_CFDC0FDSTS_EOCO_Msk));
}

/**
  * @brief    Clear Channel 0 Error occurrence counter overflow flag
  * @rmtoll   CFDC0FDSTS    EOCO    FL_CANFD_CH0_FD_ClearFlag_ErrorOccurrenceCounterOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_CH0_FD_ClearFlag_ErrorOccurrenceCounterOverflow(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDC0FDSTS, CANFD_CFDC0FDSTS_EOCO_Msk);
}

/**
  * @brief    Get Channel 0 Transceiver Delay Compensation Result
  * @rmtoll   CFDC0FDSTS    TDCR    FL_CANFD_CH0_FD_ReadTransceiverDelayCompensationResult
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_ReadTransceiverDelayCompensationResult(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDSTS, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Get Channel 0 CAN-FD Frame Stuff bit count
  * @rmtoll   CFDC0FDCRC    SCNT    FL_CANFD_CH0_FD_ReadStuffBitCount
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_ReadStuffBitCount(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCRC, (0xfU << 24U)) >> 24U);
}

/**
  * @brief    Get Channel 0 CAN-FD Frame CRC Register value
  * @rmtoll   CFDC0FDCRC    CRCREG    FL_CANFD_CH0_FD_ReadCRC
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_CH0_FD_ReadCRC(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDC0FDCRC, (0x1fffffU << 0U)) >> 0U);
}

/**
  * @brief    Get Global Parameter Status Information
  * @rmtoll   CFDGIPV    PSI    FL_CANFD_Global_FD_ReadParameterStatusInformation
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_FD_ReadParameterStatusInformation(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGIPV, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Get Global CPU bus information
  * @rmtoll   CFDGIPV    CPUBUS    FL_CANFD_Global_FD_GetCPUBusInformation
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_FD_GetCPUBusInformation(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGIPV, CANFD_CFDGIPV_CPUBUS_Msk));
}

/**
  * @brief    Get Global IP Type Release Number
  * @rmtoll   CFDGIPV    IPT    FL_CANFD_Global_FD_ReadIPTypeReleaseNumber
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_FD_ReadIPTypeReleaseNumber(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGIPV, (0x3U << 8U)) >> 8U);
}

/**
  * @brief    Get Global IP Version Release Number
  * @rmtoll   CFDGIPV    IPV    FL_CANFD_Global_FD_ReadIPVersionReleaseNumber
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_FD_ReadIPVersionReleaseNumber(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGIPV, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Get Global Interval Timer Reference Clock Prescaler
  * @rmtoll   CFDGCFG    ITRCP    FL_CANFD_Global_ReadIntervalTimerReferenceClockPrescaler
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadIntervalTimerReferenceClockPrescaler(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, (0xffffU << 16U)) >> 16U);
}

