GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_canfd.h
/**
  * @brief    Global TX Message Buffer Transmission Request disable 
  * @rmtoll   CFDTMCi    TMTR    FL_CANFD_Global_Disable_TxMBTxRequest
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_TxMBTxRequest(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    CLEAR_BIT(CANFDx->CFDTMC[txmbX], CANFD_CFDTMCi_TMTR_Msk);
}

/**
  * @brief    Get Global TX Message Buffer Transmission abort Request Mirrored
  * @rmtoll   CFDTMSTSj    TMTARM    FL_CANFD_Global_IsActiveFlag_TxMBTxAbortRequestMirrored
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxMBTxAbortRequestMirrored(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMSTS[txmbX], CANFD_CFDTMSTSj_TMTARM_Msk) == (CANFD_CFDTMSTSj_TMTARM_Msk));
}

/**
  * @brief    Get Global TX Message Buffer Transmission Request Mirrored
  * @rmtoll   CFDTMSTSj    TMTRM    FL_CANFD_Global_IsActiveFlag_TxMBTxRequestMirrored
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxMBTxRequestMirrored(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMSTS[txmbX], CANFD_CFDTMSTSj_TMTRM_Msk) == (CANFD_CFDTMSTSj_TMTRM_Msk));
}

/**
  * @brief    Get Global TX Message Buffer Transmission Result Flag
  * @rmtoll   CFDTMSTSj    TMTRF    FL_CANFD_Global_GetTxMBTxResult
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TMTRF_NO_RESULT
  *           @arg @ref FL_CANFD_TMTRF_TX_ABORTED
  *           @arg @ref FL_CANFD_TMTRF_TX_SUCCESSFUL_WITHOUT_ABORT_REQUESTED
  *           @arg @ref FL_CANFD_TMTRF_TX_SUCCESSFUL_WITH_ABORT_REQUESTED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxMBTxResult(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMSTS[txmbX], CANFD_CFDTMSTSj_TMTRF_Msk));
}

/**
  * @brief    Clear Global TX Message Buffer Transmission Result Flag
  * @rmtoll   CFDTMSTSj    TMTRF    FL_CANFD_Global_ClearFlag_TxMBTxResult
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_TxMBTxResult(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    CLEAR_BIT(CANFDx->CFDTMSTS[txmbX], CANFD_CFDTMSTSj_TMTRF_Msk);
}

/**
  * @brief    Get Global TX Message Buffer Transmission Status
  * @rmtoll   CFDTMSTSj    TMTSTS    FL_CANFD_Global_IsActiveFlag_TxMBTxStatus
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxMBTxStatus(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMSTS[txmbX], CANFD_CFDTMSTSj_TMTSTS_Msk) == (CANFD_CFDTMSTSj_TMTSTS_Msk));
}

/**
  * @brief    Get Global TX Message Buffer Transmission Request Status
  * @rmtoll   CFDTMTRSTS    CFDTMTRSTSg    FL_CANFD_Global_IsActiveFlag_TotalTxMBTxRequestStatus
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalTxMBTxRequestStatus(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMTRSTS, (CANFD_CFDTMTRSTS_CFDTMTRSTSg_Msk << txmbX)) == (CANFD_CFDTMTRSTS_CFDTMTRSTSg_Msk << txmbX));
}

/**
  * @brief    Get Global TX Message Buffer Transmission abort Request Status
  * @rmtoll   CFDTMTARSTS    CFDTMTARSTSg    FL_CANFD_Global_IsActiveFlag_TotalTxMBTxAbortRequestStatus
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalTxMBTxAbortRequestStatus(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMTARSTS, (CANFD_CFDTMTARSTS_CFDTMTARSTSg_Msk << txmbX)) == (CANFD_CFDTMTARSTS_CFDTMTARSTSg_Msk << txmbX));
}

/**
  * @brief    Get Global TX Message Buffer Transmission Completion Status
  * @rmtoll   CFDTMTCSTS    CFDTMTCSTSg    FL_CANFD_Global_IsActiveFlag_TotalTxMBTxCompletionStatus
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalTxMBTxCompletionStatus(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMTCSTS, (CANFD_CFDTMTCSTS_CFDTMTCSTSg_Msk << txmbX)) == ((CANFD_CFDTMTCSTS_CFDTMTCSTSg_Msk << txmbX)));
}

/**
  * @brief    Get Global TX Message Buffer Transmission abort Status
  * @rmtoll   CFDTMTASTS    CFDTMTASTSg    FL_CANFD_Global_IsActiveFlag_TotalTxMBTxAbortStatus
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TotalTxMBTxAbortStatus(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMTASTS, (CANFD_CFDTMTASTS_CFDTMTASTSg_Msk << txmbX)) == ((CANFD_CFDTMTASTS_CFDTMTASTSg_Msk << txmbX)));
}

/**
  * @brief    Global TX Message Buffer Interrupt Enable
  * @rmtoll   CFDTMIEC    TMIEg    FL_CANFD_Global_EnableIT_TxMB
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_TxMB(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    SET_BIT(CANFDx->CFDTMIEC, (CANFD_CFDTMIEC_TMIEg_Msk << txmbX));
}

/**
  * @brief    Global TX Message Buffer Interrupt  enable status 
  * @rmtoll   CFDTMIEC    TMIEg    FL_CANFD_Global_IsEnabledIT_TxMB
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_TxMB(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTMIEC, (CANFD_CFDTMIEC_TMIEg_Msk << txmbX)) == (CANFD_CFDTMIEC_TMIEg_Msk << txmbX));
}

/**
  * @brief    Global TX Message Buffer Interrupt disable 
  * @rmtoll   CFDTMIEC    TMIEg    FL_CANFD_Global_DisableIT_TxMB
  * @param    CANFDx CANFD instance
  * @param    txmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXMB0
  *           @arg @ref FL_CANFD_TXMB1
  *           @arg @ref FL_CANFD_TXMB2
  *           @arg @ref FL_CANFD_TXMB3
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_TxMB(CANFD_COMMON_Type* CANFDx, uint32_t txmbX)
{
    CLEAR_BIT(CANFDx->CFDTMIEC, (CANFD_CFDTMIEC_TMIEg_Msk << txmbX));
}

/**
  * @brief    Set Global TX Queue Depth Configuration
  * @rmtoll   CFDTXQCC    TXQDC    FL_CANFD_Global_SetTxQueueDepth
  * @param    CANFDx CANFD instance
  * @param    depth This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXQDC_DEPTH_0
  *           @arg @ref FL_CANFD_TXQDC_DEPTH_3
  *           @arg @ref FL_CANFD_TXQDC_DEPTH_4
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxQueueDepth(CANFD_COMMON_Type* CANFDx, uint32_t depth)
{
    MODIFY_REG(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQDC_Msk, depth);
}

/**
  * @brief    Get Global TX Queue Depth Configuration
  * @rmtoll   CFDTXQCC    TXQDC    FL_CANFD_Global_GetTxQueueDepth
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TXQDC_DEPTH_0
  *           @arg @ref FL_CANFD_TXQDC_DEPTH_3
  *           @arg @ref FL_CANFD_TXQDC_DEPTH_4
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxQueueDepth(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQDC_Msk));
}

/**
  * @brief    Set Global TX Queue Interrupt Mode
  * @rmtoll   CFDTXQCC    TXQIM    FL_CANFD_Global_SetTxQueueInterruptMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TXQIM_LAST_MESSAGE_TRANSMITTED
  *           @arg @ref FL_CANFD_TXQIM_EVERY_TRANSMISSION
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxQueueInterruptMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQIM_Msk, mode);
}

/**
  * @brief    Get Global TX Queue Interrupt Mode
  * @rmtoll   CFDTXQCC    TXQIM    FL_CANFD_Global_GetTxQueueInterruptMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TXQIM_LAST_MESSAGE_TRANSMITTED
  *           @arg @ref FL_CANFD_TXQIM_EVERY_TRANSMISSION
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxQueueInterruptMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQIM_Msk));
}

/**
  * @brief    Global TX Queue TX Interrupt Enable
  * @rmtoll   CFDTXQCC    TXQTXIE    FL_CANFD_Global_EnableIT_TxQueueTx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_TxQueueTx(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQTXIE_Msk);
}

/**
  * @brief    Global TX Queue TX Interrupt enable status 
  * @rmtoll   CFDTXQCC    TXQTXIE    FL_CANFD_Global_IsEnabledIT_TxQueueTx
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_TxQueueTx(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQTXIE_Msk) == CANFD_CFDTXQCC_TXQTXIE_Msk);
}

/**
  * @brief    Global TX Queue TX Interrupt disable 
  * @rmtoll   CFDTXQCC    TXQTXIE    FL_CANFD_Global_DisableIT_TxQueueTx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_TxQueueTx(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQTXIE_Msk);
}

/**
  * @brief    Global TX Queue Enable
  * @rmtoll   CFDTXQCC    TXQE    FL_CANFD_Global_Enable_TxQueue
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_TxQueue(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQE_Msk);
}

/**
  * @brief    Global TX Queue Enable status 
  * @rmtoll   CFDTXQCC    TXQE    FL_CANFD_Global_IsEnabled_TxQueue
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_TxQueue(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQE_Msk) == CANFD_CFDTXQCC_TXQE_Msk);
}

/**
  * @brief    Global TX Queue disable 
  * @rmtoll   CFDTXQCC    TXQE    FL_CANFD_Global_Disable_TxQueue
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_TxQueue(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDTXQCC, CANFD_CFDTXQCC_TXQE_Msk);
}

/**
  * @brief    Get Global TX Queue Message Count
  * @rmtoll   CFDTXQSTS    TXQMC    FL_CANFD_Global_ReadTxQueueMessageCount
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxQueueMessageCount(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTXQSTS, (0x7U << 8U)) >> 8U);
}

/**
  * @brief    Get Global TX Queue TX Interrupt Flag
  * @rmtoll   CFDTXQSTS    TXQTXIF    FL_CANFD_Global_IsActiveFlag_TxQueueTx
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxQueueTx(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTXQSTS, CANFD_CFDTXQSTS_TXQTXIF_Msk) == (CANFD_CFDTXQSTS_TXQTXIF_Msk));
}

/**
  * @brief    Clear Global TX Queue TX Interrupt Flag
  * @rmtoll   CFDTXQSTS    TXQTXIF    FL_CANFD_Global_ClearFlag_TxQueueTx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_TxQueueTx(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDTXQSTS, CANFD_CFDTXQSTS_TXQTXIF_Msk);
}

/**
  * @brief    Get Global TX Queue Full
  * @rmtoll   CFDTXQSTS    TXQFLL    FL_CANFD_Global_IsActiveFlag_TxQueueFull
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxQueueFull(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTXQSTS, CANFD_CFDTXQSTS_TXQFLL_Msk) == (CANFD_CFDTXQSTS_TXQFLL_Msk));
}

/**
  * @brief    Get Global TX Queue Empty
  * @rmtoll   CFDTXQSTS    TXQEMP    FL_CANFD_Global_IsActiveFlag_TxQueueEmpty
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxQueueEmpty(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTXQSTS, CANFD_CFDTXQSTS_TXQEMP_Msk) == (CANFD_CFDTXQSTS_TXQEMP_Msk));
}

/**
  * @brief    Set Global TX Queue Pointer
  * @rmtoll   CFDTXQPCTR    TXQPC    FL_CANFD_Global_WriteTxQueuePointer
  * @param    CANFDx CANFD instance
  * @param    pointer 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteTxQueuePointer(CANFD_COMMON_Type* CANFDx, uint32_t pointer)
{
    MODIFY_REG(CANFDx->CFDTXQPCTR, (0xffU << 0U), (pointer << 0U));
}

/**
  * @brief    Global TX History List Dedicated TX Enable
  * @rmtoll   CFDTHLCC    THLDTE    FL_CANFD_Global_Enable_TxHistoryListDedicatedTx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_TxHistoryListDedicatedTx(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLDTE_Msk);
}

/**
  * @brief    Global TX History List Dedicated TX Enable status 
  * @rmtoll   CFDTHLCC    THLDTE    FL_CANFD_Global_IsEnabled_TxHistoryListDedicatedTx
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_TxHistoryListDedicatedTx(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLDTE_Msk) == CANFD_CFDTHLCC_THLDTE_Msk);
}

/**
  * @brief    Global TX History List Dedicated TX disable 
  * @rmtoll   CFDTHLCC    THLDTE    FL_CANFD_Global_Disable_TxHistoryListDedicatedTx
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_TxHistoryListDedicatedTx(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLDTE_Msk);
}

/**
  * @brief    Set Global TX History List Interrupt Mode
  * @rmtoll   CFDTHLCC    THLIM    FL_CANFD_Global_SetTxHistoryListInterruptMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_THLIM_REACH_3P4_DEPTH
  *           @arg @ref FL_CANFD_THLIM_EVERY_TRANSMISSION
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxHistoryListInterruptMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLIM_Msk, mode);
}

/**
  * @brief    Get Global TX History List Interrupt Mode
  * @rmtoll   CFDTHLCC    THLIM    FL_CANFD_Global_GetTxHistoryListInterruptMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_THLIM_REACH_3P4_DEPTH
  *           @arg @ref FL_CANFD_THLIM_EVERY_TRANSMISSION
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxHistoryListInterruptMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLIM_Msk));
}

/**
  * @brief    Global TX History List Interrupt Enable
  * @rmtoll   CFDTHLCC    THLIE    FL_CANFD_Global_EnableIT_TxHistoryList
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_TxHistoryList(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLIE_Msk);
}

/**
  * @brief    Global TX History List Interrupt enable status 
  * @rmtoll   CFDTHLCC    THLIE    FL_CANFD_Global_IsEnabledIT_TxHistoryList
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_TxHistoryList(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLIE_Msk) == CANFD_CFDTHLCC_THLIE_Msk);
}

/**
  * @brief    Global TX History List Interrupt disable 
  * @rmtoll   CFDTHLCC    THLIE    FL_CANFD_Global_DisableIT_TxHistoryList
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_TxHistoryList(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLIE_Msk);
}

/**
  * @brief    Global TX History List Enable
  * @rmtoll   CFDTHLCC    THLE    FL_CANFD_Global_Enable_TxHistoryList
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_TxHistoryList(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLE_Msk);
}

/**
  * @brief    Global TX History List Enable Status 
  * @rmtoll   CFDTHLCC    THLE    FL_CANFD_Global_IsEnabled_TxHistoryList
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_TxHistoryList(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLE_Msk) == CANFD_CFDTHLCC_THLE_Msk);
}

/**
  * @brief    Global TX History List disable 
  * @rmtoll   CFDTHLCC    THLE    FL_CANFD_Global_Disable_TxHistoryList
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_TxHistoryList(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDTHLCC, CANFD_CFDTHLCC_THLE_Msk);
}

/**
  * @brief    Get Global TX History List Message Count
  * @rmtoll   CFDTHLSTS    THLMC    FL_CANFD_Global_ReadTxHistoryListMessageCount
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxHistoryListMessageCount(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTHLSTS, (0xfU << 8U)) >> 8U);
}

/**
  * @brief    Clear Global TX History List Interrupt Flag
  * @rmtoll   CFDTHLSTS    THLIF    FL_CANFD_Global_ClearFlag_TxHistoryList
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_TxHistoryList(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDTHLSTS, CANFD_CFDTHLSTS_THLIF_Msk);
}

/**
  * @brief    Get Global TX History List Entry Lost Flag
  * @rmtoll   CFDTHLSTS    THLELT    FL_CANFD_Global_IsActiveFlag_TxHistoryListEntryLost
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxHistoryListEntryLost(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTHLSTS, CANFD_CFDTHLSTS_THLELT_Msk) == (CANFD_CFDTHLSTS_THLELT_Msk));
}

/**
  * @brief    Clear Global TX History List Entry Lost Flag
  * @rmtoll   CFDTHLSTS    THLELT    FL_CANFD_Global_ClearFlag_TxHistoryListEntryLost
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_TxHistoryListEntryLost(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDTHLSTS, CANFD_CFDTHLSTS_THLELT_Msk);
}

/**
  * @brief    Get Global TX History List Full
  * @rmtoll   CFDTHLSTS    THLFLL    FL_CANFD_Global_IsActiveFlag_TxHistoryListFull
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxHistoryListFull(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTHLSTS, CANFD_CFDTHLSTS_THLFLL_Msk) == (CANFD_CFDTHLSTS_THLFLL_Msk));
}

/**
  * @brief    Get Global TX History List Empty
  * @rmtoll   CFDTHLSTS    THLEMP    FL_CANFD_Global_IsActiveFlag_TxHistoryListEmpty
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxHistoryListEmpty(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDTHLSTS, CANFD_CFDTHLSTS_THLEMP_Msk) == (CANFD_CFDTHLSTS_THLEMP_Msk));
}

/**
  * @brief    Get Global TX History List Transmit Timestamp
  * @rmtoll   CFDTHLACC0    TMTS    FL_CANFD_Global_ReadTxHistoryListTransmitTimestamp
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxHistoryListTransmitTimestamp(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFD_BUFFER[0].TX_HISTORY_LIST->CFDTHLACC0, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Get Global TX History List Buffer Number
  * @rmtoll   CFDTHLACC0    BN    FL_CANFD_Global_ReadTxHistoryListBufferNumber
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxHistoryListBufferNumber(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFD_BUFFER[0].TX_HISTORY_LIST->CFDTHLACC0, (0x3U << 3U)) >> 3U);
}

/**
  * @brief    Get Global TX History List Buffer Type
  * @rmtoll   CFDTHLACC0    BT    FL_CANFD_Global_GetTxHistoryListBufferType
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_BT_TX_MB
  *           @arg @ref FL_CANFD_BT_TX_FIFO
  *           @arg @ref FL_CANFD_BT_TX_QUEUE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxHistoryListBufferType(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFD_BUFFER[0].TX_HISTORY_LIST->CFDTHLACC0, CANFD_CFDTHLACC0_BT_Msk));
}

