GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_canfd.h
/**
  * @brief    Get Global TX History List Transmit Information Label
  * @rmtoll   CFDTHLACC1    TIFL    FL_CANFD_Global_ReadTxHistoryListTransmitInformationLabel
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxHistoryListTransmitInformationLabel(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFD_BUFFER[0].TX_HISTORY_LIST->CFDTHLACC1, (0x3U << 16U)) >> 16U);
}

/**
  * @brief    Get Global TX History List Transmit ID
  * @rmtoll   CFDTHLACC1    TID    FL_CANFD_Global_ReadTxHistoryListTransmitID
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadTxHistoryListTransmitID(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFD_BUFFER[0].TX_HISTORY_LIST->CFDTHLACC1, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global TX History List Pointer
  * @rmtoll   CFDTHLPCTR    THLPC    FL_CANFD_Global_WriteTxHistoryListPointer
  * @param    CANFDx CANFD instance
  * @param    pointer 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteTxHistoryListPointer(CANFD_COMMON_Type* CANFDx, uint32_t pointer)
{
    MODIFY_REG(CANFDx->CFDTHLPCTR, (0xffU << 0U), (pointer << 0U));
}

/**
  * @brief    Set Global Reset Control Key
  * @rmtoll   CFDGRSTC    KEY    FL_CANFD_Global_WriteKeyOfReset
  * @param    CANFDx CANFD instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteKeyOfReset(CANFD_COMMON_Type* CANFDx, uint32_t key)
{
    MODIFY_REG(CANFDx->CFDGRSTC, (0xffU << 8U), (key << 8U));
}

/**
  * @brief    Set Global Reset Control software reset 
  * @rmtoll   CFDGRSTC    SRST    FL_CANFD_Global_SetSoftwareReset
  * @param    CANx CAN instance
  * @param    reset This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_SRST_NO_RESET
  *           @arg @ref FL_CANFD_SRST_RESET
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetSoftwareReset(CANFD_COMMON_Type* CANx, uint32_t reset)
{
    MODIFY_REG(CANx->CFDGRSTC, CANFD_CFDGRSTC_SRST_Msk, reset);
}

/**
  * @brief    Get Global Reset Control software reset 
  * @rmtoll   CFDGRSTC    SRST    FL_CANFD_Global_GetSoftwareReset
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_SRST_NO_RESET
  *           @arg @ref FL_CANFD_SRST_RESET
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetSoftwareReset(CANFD_COMMON_Type* CANx)
{
    return (uint32_t)(READ_BIT(CANx->CFDGRSTC, CANFD_CFDGRSTC_SRST_Msk));
}

/**
  * @brief    CANFD Asycnchronous WakeUp Interrupt Enable
  * @rmtoll   CFDWKCR    CFD0WKIE    FL_CANFD_Global_Enable_CANFDWakeUpInterrupt
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_CANFDWakeUpInterrupt(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDWKCR, CANFD_CFDWKCR_CFD0WKIE_Msk);
}

/**
  * @brief    Get CANFD Asycnchronous WakeUp Interrupt Enable status
  * @rmtoll   CFDWKCR    CFD0WKIE    FL_CANFD_Global_IsEnabled_CANFDWakeUpInterrupt
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_CANFDWakeUpInterrupt(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDWKCR, CANFD_CFDWKCR_CFD0WKIE_Msk) == CANFD_CFDWKCR_CFD0WKIE_Msk);
}

/**
  * @brief    CANFD Asycnchronous WakeUp Interrupt Disable
  * @rmtoll   CFDWKCR    CFD0WKIE    FL_CANFD_Global_Disable_CANFDWakeUpInterrupt
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_CANFDWakeUpInterrupt(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDWKCR, CANFD_CFDWKCR_CFD0WKIE_Msk);
}

/**
  * @brief    CANFD Asycnchronous WakeUp Enable
  * @rmtoll   CFDWKCR    CFD0WKEN    FL_CANFD_Global_Enable_CANFDWakeUp
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_CANFDWakeUp(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDWKCR, CANFD_CFDWKCR_CFD0WKEN_Msk);
}

/**
  * @brief    Get CANFD Asycnchronous WakeUp Enable status
  * @rmtoll   CFDWKCR    CFD0WKEN    FL_CANFD_Global_IsEnabled_CANFDWakeUp
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_CANFDWakeUp(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDWKCR, CANFD_CFDWKCR_CFD0WKEN_Msk) == CANFD_CFDWKCR_CFD0WKEN_Msk);
}

/**
  * @brief    CANFD Asycnchronous WakeUp Disable
  * @rmtoll   CFDWKCR    CFD0WKEN    FL_CANFD_Global_Disable_CANFDWakeUp
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_CANFDWakeUp(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDWKCR, CANFD_CFDWKCR_CFD0WKEN_Msk);
}

/**
  * @brief    Get CANFD Asycnchronous WakeUp Interrupt Flag
  * @rmtoll   CFDWKSR    CFD0WKIF    FL_CANFD_IsActiveFlag_CANFDWakeUpInterrupt
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_IsActiveFlag_CANFDWakeUpInterrupt(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDWKSR, CANFD_CFDWKSR_CFD0WKIF_Msk) == (CANFD_CFDWKSR_CFD0WKIF_Msk));
}

/**
  * @brief    Clear CANFD Asycnchronous WakeUp Interrupt Flag
  * @rmtoll   CFDWKSR    CFD0WKIF    FL_CANFD_ClearFlag_CANFDWakeUpInterrupt
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_ClearFlag_CANFDWakeUpInterrupt(CANFD_COMMON_Type* CANFDx)
{
    WRITE_REG(CANFDx->CFDWKSR, CANFD_CFDWKSR_CFD0WKIF_Msk);
}

/**
  * @brief    Set Global RAM Test Mode Page Select
  * @rmtoll   CFDGTSTCFG    RTMPS    FL_CANFD_Global_WriteRAMTestModePageSelect
  * @param    CANFDx CANFD instance
  * @param    page 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteRAMTestModePageSelect(CANFD_COMMON_Type* CANFDx, uint32_t page)
{
    MODIFY_REG(CANFDx->CFDGTSTCFG, (0xfU << 16U), (page << 16U));
}

/**
  * @brief    Get Global RAM Test Mode Page Select
  * @rmtoll   CFDGTSTCFG    RTMPS    FL_CANFD_Global_ReadRAMTestModePageSelect
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRAMTestModePageSelect(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGTSTCFG, (0xfU << 16U)) >> 16U);
}

/**
  * @brief    Global RAM Test Mode Enable
  * @rmtoll   CFDGTSTCTR    RTME    FL_CANFD_Global_Enable_RAMTestMode
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_RAMTestMode(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGTSTCTR, CANFD_CFDGTSTCTR_RTME_Msk);
}

/**
  * @brief    Global RAM Test Mode Enable status 
  * @rmtoll   CFDGTSTCTR    RTME    FL_CANFD_Global_IsEnabled_RAMTestMode
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_RAMTestMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGTSTCTR, CANFD_CFDGTSTCTR_RTME_Msk) == CANFD_CFDGTSTCTR_RTME_Msk);
}

/**
  * @brief    Global RAM Test Mode disable 
  * @rmtoll   CFDGTSTCTR    RTME    FL_CANFD_Global_Disable_RAMTestMode
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_RAMTestMode(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGTSTCTR, CANFD_CFDGTSTCTR_RTME_Msk);
}

/**
  * @brief    Set Global Timestamp capture configuration
  * @rmtoll   CFDGFDCFG    TSCCFG    FL_CANFD_Global_SetTimestampCaptureConfiguration
  * @param    CANFDx CANFD instance
  * @param    location This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TSCCFG_SOF
  *           @arg @ref FL_CANFD_TSCCFG_FRAME_VALID_INDICATION
  *           @arg @ref FL_CANFD_TSCCFG_RES
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTimestampCaptureConfiguration(CANFD_COMMON_Type* CANFDx, uint32_t location)
{
    MODIFY_REG(CANFDx->CFDGFDCFG, CANFD_CFDGFDCFG_TSCCFG_Msk, location);
}

/**
  * @brief    Get Global Timestamp capture configuration
  * @rmtoll   CFDGFDCFG    TSCCFG    FL_CANFD_Global_GetTimestampCaptureConfiguration
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TSCCFG_SOF
  *           @arg @ref FL_CANFD_TSCCFG_FRAME_VALID_INDICATION
  *           @arg @ref FL_CANFD_TSCCFG_RES
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTimestampCaptureConfiguration(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGFDCFG, CANFD_CFDGFDCFG_TSCCFG_Msk));
}

/**
  * @brief    Global RES bit Protocol exception disable Configuration Enable
  * @rmtoll   CFDGFDCFG    RPED    FL_CANFD_Global_Enable_RESProtocolExceptionDisabled
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_RESProtocolExceptionDisabled(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGFDCFG, CANFD_CFDGFDCFG_RPED_Msk);
}

/**
  * @brief    Global RES bit Protocol exception disable Configuration Enable status 
  * @rmtoll   CFDGFDCFG    RPED    FL_CANFD_Global_IsEnabled_RESProtocolExceptionDisabled
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_RESProtocolExceptionDisabled(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGFDCFG, CANFD_CFDGFDCFG_RPED_Msk) == CANFD_CFDGFDCFG_RPED_Msk);
}

/**
  * @brief    Global RES bit Protocol exception disable Configuration disable 
  * @rmtoll   CFDGFDCFG    RPED    FL_CANFD_Global_Disable_RESProtocolExceptionDisabled
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_RESProtocolExceptionDisabled(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGFDCFG, CANFD_CFDGFDCFG_RPED_Msk);
}

/**
  * @brief    Set Global Lock Key
  * @rmtoll   CFDGLOCKK    LOCK    FL_CANFD_Global_WriteLockKeyOfRAMTestMode
  * @param    CANFDx CANFD instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteLockKeyOfRAMTestMode(CANFD_COMMON_Type* CANFDx, uint32_t key)
{
    MODIFY_REG(CANFDx->CFDGLOCKK, (0xffffU << 0U), (key << 0U));
}

/**
  * @brief    Set Global RAM Data Test Access
  * @rmtoll   CFDRPGACCk    RDTA    FL_CANFD_Global_WriteRAMDataTestAccess
  * @param    CANFDx CANFD instance
  * @param    dataX 
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteRAMDataTestAccess(CANFD_COMMON_Type* CANFDx, uint32_t dataX, uint32_t data)
{
    MODIFY_REG(CANFDx->CFDRPGACC[dataX], (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    Get Global RAM Data Test Access
  * @rmtoll   CFDRPGACCk    RDTA    FL_CANFD_Global_ReadRAMDataTestAccess
  * @param    CANFDx CANFD instance
  * @param    dataX This parameter can be one of the following values:
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRAMDataTestAccess(CANFD_COMMON_Type* CANFDx, uint32_t dataX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRPGACC[dataX], (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Global Pretended Network Filter List Data Access Enable
  * @rmtoll   CFDGPFLECTR    PFLDAE    FL_CANFD_Global_Enable_GPFLDataAccess
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_GPFLDataAccess(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGPFLECTR, CANFD_CFDGPFLECTR_PFLDAE_Msk);
}

/**
  * @brief    Global Pretended Network Filter List Data Access Enable status 
  * @rmtoll   CFDGPFLECTR    PFLDAE    FL_CANFD_Global_IsEnabled_GPFLDataAccess
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_GPFLDataAccess(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFLECTR, CANFD_CFDGPFLECTR_PFLDAE_Msk) == CANFD_CFDGPFLECTR_PFLDAE_Msk);
}

/**
  * @brief    Global Pretended Network Filter List Data Access disable 
  * @rmtoll   CFDGPFLECTR    PFLDAE    FL_CANFD_Global_Disable_GPFLDataAccess
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_GPFLDataAccess(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGPFLECTR, CANFD_CFDGPFLECTR_PFLDAE_Msk);
}

/**
  * @brief    Set Global Pretended Network Filter List Rule Number
  * @rmtoll   CFDGPFLCFG    RNC    FL_CANFD_Global_WriteGPFLRuleNumber
  * @param    CANFDx CANFD instance
  * @param    number 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLRuleNumber(CANFD_COMMON_Type* CANFDx, uint32_t number)
{
    MODIFY_REG(CANFDx->CFDGPFLCFG, (0x3U << 24U), (number << 24U));
}

/**
  * @brief    Get Global Pretended Network Filter List Rule Number
  * @rmtoll   CFDGPFLCFG    RNC    FL_CANFD_Global_ReadGPFLRuleNumber
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLRuleNumber(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFLCFG, (0x3U << 24U)) >> 24U);
}

/**
  * @brief    Set Global Pretended Network Filter List Entry IDE Field
  * @rmtoll   CFDGPFLIDs    GPFLIDE    FL_CANFD_Global_SetGPFLIDE
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    ide This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_IDE_STANDARD
  *           @arg @ref FL_CANFD_GPFL_IDE_EXTENDED
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLIDE(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t ide)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLIDs, CANFD_CFDGPFLIDs_GPFLIDE_Msk, ide);
}

/**
  * @brief    Get Global Pretended Network Filter List Entry IDE Field
  * @rmtoll   CFDGPFLIDs    GPFLIDE    FL_CANFD_Global_GetGPFLIDE
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_IDE_STANDARD
  *           @arg @ref FL_CANFD_GPFL_IDE_EXTENDED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLIDE(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLIDs, CANFD_CFDGPFLIDs_GPFLIDE_Msk));
}

/**
  * @brief    Set Global Pretended Network Filter List Entry RTR Field
  * @rmtoll   CFDGPFLIDs    GPFLRTR    FL_CANFD_Global_SetGPFLRTR
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    rtr This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_GPFL_RTR_REMOTE_FRAME
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLRTR(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t rtr)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLIDs, CANFD_CFDGPFLIDs_GPFLRTR_Msk, rtr);
}

/**
  * @brief    Get Global Pretended Network Filter List Entry RTR Field
  * @rmtoll   CFDGPFLIDs    GPFLRTR    FL_CANFD_Global_GetGPFLRTR
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_GPFL_RTR_REMOTE_FRAME
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLRTR(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLIDs, CANFD_CFDGPFLIDs_GPFLRTR_Msk));
}

/**
  * @brief    Set Global Pretended Network Filter List Entry Loopback Configuration
  * @rmtoll   CFDGPFLIDs    GPFLLB    FL_CANFD_Global_SetGPFLLoopback
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    loopback This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_LB_RX
  *           @arg @ref FL_CANFD_GPFL_LB_TX
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLLoopback(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t loopback)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLIDs, CANFD_CFDGPFLIDs_GPFLLB_Msk, loopback);
}

/**
  * @brief    Get Global Pretended Network Filter List Entry Loopback Configuration
  * @rmtoll   CFDGPFLIDs    GPFLLB    FL_CANFD_Global_GetGPFLLoopback
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_LB_RX
  *           @arg @ref FL_CANFD_GPFL_LB_TX
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLLoopback(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLIDs, CANFD_CFDGPFLIDs_GPFLLB_Msk));
}

/**
  * @brief    Set Global Pretended Network Filter List Entry ID Field
  * @rmtoll   CFDGPFLIDs    GPFLID    FL_CANFD_Global_WriteGPFLID
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    id 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLID(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t id)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLIDs, (0x1fffffffU << 0U), (id << 0U));
}

/**
  * @brief    Get Global Pretended Network Filter List Entry ID Field
  * @rmtoll   CFDGPFLIDs    GPFLID    FL_CANFD_Global_ReadGPFLID
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLID(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLIDs, (0x1fffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Pretended Network Filter List IDE Mask 
  * @rmtoll   CFDGPFLMs    GPFLIDEM    FL_CANFD_Global_SetGPFLIDEMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    idem This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_IDEM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GPFL_IDEM_CONSIDERED
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLIDEMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t idem)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLMs, CANFD_CFDGPFLMs_GPFLIDEM_Msk, idem);
}

/**
  * @brief    Get Global Pretended Network Filter List IDE Mask 
  * @rmtoll   CFDGPFLMs    GPFLIDEM    FL_CANFD_Global_GetGPFLIDEMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_IDEM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GPFL_IDEM_CONSIDERED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLIDEMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLMs, CANFD_CFDGPFLMs_GPFLIDEM_Msk));
}

/**
  * @brief    Set Global Pretended Network Filter List Entry RTR Mask
  * @rmtoll   CFDGPFLMs    GPFLRTRM    FL_CANFD_Global_SetGPFLRTRMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    rtrm This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_RTRM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GPFL_RTRM_CONSIDERED
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLRTRMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t rtrm)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLMs, CANFD_CFDGPFLMs_GPFLRTRM_Msk, rtrm);
}

/**
  * @brief    Get Global Pretended Network Filter List Entry RTR Mask
  * @rmtoll   CFDGPFLMs    GPFLRTRM    FL_CANFD_Global_GetGPFLRTRMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_RTRM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GPFL_RTRM_CONSIDERED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLRTRMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLMs, CANFD_CFDGPFLMs_GPFLRTRM_Msk));
}

/**
  * @brief    Set Global Pretended Network Filter List Information Label 1
  * @rmtoll   CFDGPFLMs    GPFLIFL1    FL_CANFD_Global_SetGPFLInfoLabel1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    label This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_INFO_LABEL1_0
  *           @arg @ref FL_CANFD_GPFL_INFO_LABEL1_1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLInfoLabel1(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t label)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLMs, CANFD_CFDGPFLMs_GPFLIFL1_Msk, label);
}

/**
  * @brief    Get Global Pretended Network Filter List Information Label 1
  * @rmtoll   CFDGPFLMs    GPFLIFL1    FL_CANFD_Global_GetGPFLInfoLabel1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_INFO_LABEL1_0
  *           @arg @ref FL_CANFD_GPFL_INFO_LABEL1_1
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLInfoLabel1(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLMs, CANFD_CFDGPFLMs_GPFLIFL1_Msk));
}

/**
  * @brief    Set Global Pretended Network Filter List ID Mask Field
  * @rmtoll   CFDGPFLMs    GPFLIDM    FL_CANFD_Global_WriteGPFLIDMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    idm 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLIDMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t idm)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLMs, (0x1fffffffU << 0U), (idm << 0U));
}

