GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_canfd.h
/**
  * @brief    Get Global Pretended Network Filter List ID Mask Field
  * @rmtoll   CFDGPFLMs    GPFLIDM    FL_CANFD_Global_ReadGPFLIDMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLIDMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLMs, (0x1fffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Pretended Network Filter List Pointer Field
  * @rmtoll   CFDGPFLP0s    GPFLPTR    FL_CANFD_Global_WriteGPFLPointer
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    ptr 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLPointer(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t ptr)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, (0xffffU << 16U), (ptr << 16U));
}

/**
  * @brief    Get Global Pretended Network Filter List Pointer Field
  * @rmtoll   CFDGPFLP0s    GPFLPTR    FL_CANFD_Global_ReadGPFLPointer
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLPointer(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Set Global Pretended Network Filter List RX Message Buffer Valid
  * @rmtoll   CFDGPFLP0s    GPFLRMV    FL_CANFD_Global_SetGPFLRxMBValid
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    valid This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_SINGLE_RXMB_INVALID
  *           @arg @ref FL_CANFD_GPFL_SINGLE_RXMB_VALID
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLRxMBValid(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t valid)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, CANFD_CFDGPFLP0s_GPFLRMV_Msk, valid);
}

/**
  * @brief    Get Global Pretended Network Filter List RX Message Buffer Valid
  * @rmtoll   CFDGPFLP0s    GPFLRMV    FL_CANFD_Global_GetGPFLRxMBValid
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_SINGLE_RXMB_INVALID
  *           @arg @ref FL_CANFD_GPFL_SINGLE_RXMB_VALID
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLRxMBValid(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, CANFD_CFDGPFLP0s_GPFLRMV_Msk));
}

/**
  * @brief    Set Global Pretended Network Filter List RX Message Buffer Direction Pointer
  * @rmtoll   CFDGPFLP0s    GPFLRMDP    FL_CANFD_Global_WriteGPFLRxMBDirectionPointer
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    number 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLRxMBDirectionPointer(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t number)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, (0x1fU << 8U), (number << 8U));
}

/**
  * @brief    Get Global Pretended Network Filter List RX Message Buffer Direction Pointer
  * @rmtoll   CFDGPFLP0s    GPFLRMDP    FL_CANFD_Global_ReadGPFLRxMBDirectionPointer
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLRxMBDirectionPointer(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, (0x1fU << 8U)) >> 8U);
}

/**
  * @brief    Set Global Pretended Network Filter List Information Label 0
  * @rmtoll   CFDGPFLP0s    GPFLIFL0    FL_CANFD_Global_SetGPFLInfoLabel0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    label This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_INFO_LABEL0_0
  *           @arg @ref FL_CANFD_GPFL_INFO_LABEL0_1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLInfoLabel0(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t label)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, CANFD_CFDGPFLP0s_GPFLIFL0_Msk, label);
}

/**
  * @brief    Get Global Pretended Network Filter List Information Label 0
  * @rmtoll   CFDGPFLP0s    GPFLIFL0    FL_CANFD_Global_GetGPFLInfoLabel0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFL_INFO_LABEL0_0
  *           @arg @ref FL_CANFD_GPFL_INFO_LABEL0_1
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLInfoLabel0(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, CANFD_CFDGPFLP0s_GPFLIFL0_Msk));
}

/**
  * @brief    Set Global Pretended Network Filter List DLC Field
  * @rmtoll   CFDGPFLP0s    GPFLDLC    FL_CANFD_Global_WriteGPFLDLC
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    length 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLDLC(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t length)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, (0xfU << 0U), (length << 0U));
}

/**
  * @brief    Get Global Pretended Network Filter List DLC Field
  * @rmtoll   CFDGPFLP0s    GPFLDLC    FL_CANFD_Global_ReadGPFLDLC
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLDLC(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP0s, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Global Pretended Network Filter List Common FIFO Reception enable 
  * @rmtoll   CFDGPFLP1s    GPFLFDPH    FL_CANFD_Global_Enable_GPFLCommonFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_GPFLCommonFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    SET_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP1s, CANFD_CFDGPFLP1s_GPFLFDPH_Msk);
}

/**
  * @brief    Global Pretended Network Filter List Common FIFO Reception enable status 
  * @rmtoll   CFDGPFLP1s    GPFLFDPH    FL_CANFD_Global_IsEnabled_GPFLCommonFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_GPFLCommonFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP1s, CANFD_CFDGPFLP1s_GPFLFDPH_Msk) == CANFD_CFDGPFLP1s_GPFLFDPH_Msk);
}

/**
  * @brief    Global Pretended Network Filter List Common FIFO Reception disable 
  * @rmtoll   CFDGPFLP1s    GPFLFDPH    FL_CANFD_Global_Disable_GPFLCommonFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_GPFLCommonFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    CLEAR_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP1s, CANFD_CFDGPFLP1s_GPFLFDPH_Msk);
}

/**
  * @brief    Global Pretended Network Filter List RxFIFO Reception enable 
  * @rmtoll   CFDGPFLP1s    GPFLFDPL    FL_CANFD_Global_Enable_GPFLRxFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_GPFLRxFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t rxfifoX)
{
    SET_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP1s, (CANFD_CFDGPFLP1s_GPFLFDPL_Msk << rxfifoX));
}

/**
  * @brief    Global Pretended Network Filter List RxFIFO Reception enable status 
  * @rmtoll   CFDGPFLP1s    GPFLFDPL    FL_CANFD_Global_IsEnabled_GPFLRxFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_GPFLRxFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP1s, (CANFD_CFDGPFLP1s_GPFLFDPL_Msk << rxfifoX)) == (CANFD_CFDGPFLP1s_GPFLFDPL_Msk << rxfifoX));
}

/**
  * @brief    Global Pretended Network Filter List RxFIFO Reception disable 
  * @rmtoll   CFDGPFLP1s    GPFLFDPL    FL_CANFD_Global_Disable_GPFLRxFIFOReception
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_GPFLRxFIFOReception(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t rxfifoX)
{
    CLEAR_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLP1s, (CANFD_CFDGPFLP1s_GPFLFDPL_Msk << rxfifoX));
}

/**
  * @brief    Set Global Pretended Network filter conditions of the filters 0 and 1
  * @rmtoll   CFDGPFLPTs    GPFLANDOR    FL_CANFD_Global_SetGPFLConditionsOfFilters
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    condition This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLANDOR_AND
  *           @arg @ref FL_CANFD_GPFLANDOR_OR
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLConditionsOfFilters(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t condition)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLANDOR_Msk, condition);
}

/**
  * @brief    Get Global Pretended Network filter conditions of the filters 0 and 1
  * @rmtoll   CFDGPFLPTs    GPFLANDOR    FL_CANFD_Global_GetGPFLConditionsOfFilters
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLANDOR_AND
  *           @arg @ref FL_CANFD_GPFLANDOR_OR
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLConditionsOfFilters(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLANDOR_Msk));
}

/**
  * @brief    Set Global Pretended Network filter comparison conditions of the filter0
  * @rmtoll   CFDGPFLPTs    GPFLRANG0    FL_CANFD_Global_SetGPFLComparisonConditionsOfFilter0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    range This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLRANG0_MATCH
  *           @arg @ref FL_CANFD_GPFLRANG0_RANGE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLComparisonConditionsOfFilter0(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t range)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLRANG0_Msk, range);
}

/**
  * @brief    Get Global Pretended Network filter comparison conditions of the filter0
  * @rmtoll   CFDGPFLPTs    GPFLRANG0    FL_CANFD_Global_GetGPFLComparisonConditionsOfFilter0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLRANG0_MATCH
  *           @arg @ref FL_CANFD_GPFLRANG0_RANGE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLComparisonConditionsOfFilter0(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLRANG0_Msk));
}

/**
  * @brief    Set Global Pretended Network filter conditions of upper/lower filter of the filter0
  * @rmtoll   CFDGPFLPTs    GPFLOUT0    FL_CANFD_Global_SetGPFLLimitConditionsOfFilter0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    condition This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLOUT0_WITHIN
  *           @arg @ref FL_CANFD_GPFLOUT0_OUTSIDE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLLimitConditionsOfFilter0(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t condition)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLOUT0_Msk, condition);
}

/**
  * @brief    Get Global Pretended Network filter conditions of upper/lower filter of the filter0
  * @rmtoll   CFDGPFLPTs    GPFLOUT0    FL_CANFD_Global_GetGPFLLimitConditionsOfFilter0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLOUT0_WITHIN
  *           @arg @ref FL_CANFD_GPFLOUT0_OUTSIDE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLLimitConditionsOfFilter0(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLOUT0_Msk));
}

/**
  * @brief    Set Global Pretended Network filter offset value of the filter0
  * @rmtoll   CFDGPFLPTs    GPFLOFFSET0    FL_CANFD_Global_WriteGPFLOffsetOfFilter0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    offset 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLOffsetOfFilter0(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t offset)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, (0xfU << 16U), (offset << 16U));
}

/**
  * @brief    Get Global Pretended Network filter offset value of the filter0
  * @rmtoll   CFDGPFLPTs    GPFLOFFSET0    FL_CANFD_Global_ReadGPFLOffsetOfFilter0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLOffsetOfFilter0(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, (0xfU << 16U)) >> 16U);
}

/**
  * @brief    Set Global Pretended Network filter comparison conditions of the filter1
  * @rmtoll   CFDGPFLPTs    GPFLRANG1    FL_CANFD_Global_SetGPFLComparisonConditionsOfFilter1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    range This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLRANG1_MATCH
  *           @arg @ref FL_CANFD_GPFLRANG1_RANGE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLComparisonConditionsOfFilter1(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t range)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLRANG1_Msk, range);
}

/**
  * @brief    Get Global Pretended Network filter comparison conditions of the filter1
  * @rmtoll   CFDGPFLPTs    GPFLRANG1    FL_CANFD_Global_GetGPFLComparisonConditionsOfFilter1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLRANG1_MATCH
  *           @arg @ref FL_CANFD_GPFLRANG1_RANGE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLComparisonConditionsOfFilter1(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLRANG1_Msk));
}

/**
  * @brief    Set Global Pretended Network filter conditions of upper/lower filter of the filter1
  * @rmtoll   CFDGPFLPTs    GPFLOUT1    FL_CANFD_Global_SetGPFLLimitConditionsOfFilter1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    condition This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLOUT1_WITHIN
  *           @arg @ref FL_CANFD_GPFLOUT1_OUTSIDE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGPFLLimitConditionsOfFilter1(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t condition)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLOUT1_Msk, condition);
}

/**
  * @brief    Get Global Pretended Network filter conditions of upper/lower filter of the filter1
  * @rmtoll   CFDGPFLPTs    GPFLOUT1    FL_CANFD_Global_GetGPFLLimitConditionsOfFilter1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GPFLOUT1_WITHIN
  *           @arg @ref FL_CANFD_GPFLOUT1_OUTSIDE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGPFLLimitConditionsOfFilter1(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, CANFD_CFDGPFLPTs_GPFLOUT1_Msk));
}

/**
  * @brief    Set Global Pretended Network filter offset value of the filter1
  * @rmtoll   CFDGPFLPTs    GPFLOFFSET1    FL_CANFD_Global_WriteGPFLOffsetOfFilter1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    offset 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLOffsetOfFilter1(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t offset)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, (0xfU << 0U), (offset << 0U));
}

/**
  * @brief    Get Global Pretended Network filter offset value of the filter1
  * @rmtoll   CFDGPFLPTs    GPFLOFFSET1    FL_CANFD_Global_ReadGPFLOffsetOfFilter1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLOffsetOfFilter1(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPTs, (0xfU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Pretended Network Filter List Filter data 0
  * @rmtoll   CFDGPFLPD0s    FDATA    FL_CANFD_Global_WriteGPFLFilterData0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLFilterData0(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t data)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPD0s, (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    Get Global Pretended Network Filter List Filter data 0
  * @rmtoll   CFDGPFLPD0s    FDATA    FL_CANFD_Global_ReadGPFLFilterData0
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLFilterData0(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPD0s, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Pretended Network Filter List Filter data 1
  * @rmtoll   CFDGPFLPD1s    FDATA    FL_CANFD_Global_WriteGPFLFilterData1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLFilterData1(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t data)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPD1s, (0xffffffffU << 0U), (data << 0U));
}

