GUdaoxi/demo_qspi/Drivers/FM33FH0xx_FL_Driver/Inc/fm33fh0xx_fl_canfd.h
/**
  * @brief    Get Global Pretended Network Filter List Filter data 1
  * @rmtoll   CFDGPFLPD1s    FDATA    FL_CANFD_Global_ReadGPFLFilterData1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLFilterData1(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPD1s, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Pretended Network Filter List Filter data 0 mask field
  * @rmtoll   CFDGPFLPM0s    FMASK    FL_CANFD_Global_WriteGPFLFilterData0Mask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    mask 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLFilterData0Mask(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t mask)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPM0s, (0xffffffffU << 0U), (mask << 0U));
}

/**
  * @brief    Get Global Pretended Network Filter List Filter data 0 mask field
  * @rmtoll   CFDGPFLPM0s    FMASK    FL_CANFD_Global_ReadGPFLFilterData0Mask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLFilterData0Mask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPM0s, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Pretended Network Filter List Filter data 1 mask field
  * @rmtoll   CFDGPFLPM1s    FMASK    FL_CANFD_Global_WriteGPFLFilterData1Mask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @param    mask 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGPFLFilterData1Mask(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t mask)
{
    MODIFY_REG(CANFDx->CFDGPFL[filterX].CFDGPFLPM1s, (0xffffffffU << 0U), (mask << 0U));
}

/**
  * @brief    Get Global Pretended Network Filter List Filter data 1 mask field
  * @rmtoll   CFDGPFLPM1s    FMASK    FL_CANFD_Global_ReadGPFLFilterData1Mask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_PFL_FILTER0
  *           @arg @ref FL_CANFD_PFL_FILTER1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGPFLFilterData1Mask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGPFL[filterX].CFDGPFLPM1s, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global AFL Ignore Rule Number
  * @rmtoll   CFDGAFLIGNENT    IRN    FL_CANFD_Global_WriteGAFLIgnoreRuleNumber
  * @param    CANFDx CANFD instance
  * @param    number 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGAFLIgnoreRuleNumber(CANFD_COMMON_Type* CANFDx, uint32_t number)
{
    MODIFY_REG(CANFDx->CFDGAFLIGNENT, (0x1fU << 0U), (number << 0U));
}

/**
  * @brief    Get Global AFL Ignore Rule Number
  * @rmtoll   CFDGAFLIGNENT    IRN    FL_CANFD_Global_ReadGAFLIgnoreRuleNumber
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGAFLIgnoreRuleNumber(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFLIGNENT, (0x1fU << 0U)) >> 0U);
}

/**
  * @brief    Set Global AFL Ignore Rule Enable Key
  * @rmtoll   CFDGAFLIGNCTR    KEY    FL_CANFD_Global_WriteGAFLKeyOfIgnoreRuleEnable
  * @param    CANFDx CANFD instance
  * @param    key 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGAFLKeyOfIgnoreRuleEnable(CANFD_COMMON_Type* CANFDx, uint32_t key)
{
    MODIFY_REG(CANFDx->CFDGAFLIGNCTR, (0xffU << 8U), (key << 8U));
}

/**
  * @brief    Global AFL Ignore Rule enable 
  * @rmtoll   CFDGAFLIGNCTR    IREN    FL_CANFD_Global_Enable_GAFLIgnoreRule
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_GAFLIgnoreRule(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGAFLIGNCTR, CANFD_CFDGAFLIGNCTR_IREN_Msk);
}

/**
  * @brief    Global AFL Ignore Rule enable status 
  * @rmtoll   CFDGAFLIGNCTR    IREN    FL_CANFD_Global_IsEnabled_GAFLIgnoreRule
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_GAFLIgnoreRule(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFLIGNCTR, CANFD_CFDGAFLIGNCTR_IREN_Msk) == CANFD_CFDGAFLIGNCTR_IREN_Msk);
}

/**
  * @brief    Global AFL Ignore Rule disable 
  * @rmtoll   CFDGAFLIGNCTR    IREN    FL_CANFD_Global_Disable_GAFLIgnoreRule
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_GAFLIgnoreRule(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGAFLIGNCTR, CANFD_CFDGAFLIGNCTR_IREN_Msk);
}

/**
  * @brief    Global RX Message Buffer Interrupt Enable
  * @rmtoll   CFDRMIEC    RMIEg    FL_CANFD_Global_EnableIT_RxMB
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_RxMB(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    SET_BIT(CANFDx->CFDRMIEC, (CANFD_CFDRMIEC_RMIEg_Msk << rxmbX));
}

/**
  * @brief    Global RX Message Buffer Interrupt  enable status 
  * @rmtoll   CFDRMIEC    RMIEg    FL_CANFD_Global_IsEnabledIT_RxMB
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_RxMB(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRMIEC, (CANFD_CFDRMIEC_RMIEg_Msk << rxmbX)) == (CANFD_CFDRMIEC_RMIEg_Msk << rxmbX));
}

/**
  * @brief    Global RX Message Buffer Interrupt disable 
  * @rmtoll   CFDRMIEC    RMIEg    FL_CANFD_Global_DisableIT_RxMB
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_RxMB(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    CLEAR_BIT(CANFDx->CFDRMIEC, (CANFD_CFDRMIEC_RMIEg_Msk << rxmbX));
}

/**
  * @brief    Get Global RX Message Buffer IDE Bit 
  * @rmtoll   CFDRMID    RMIDE    FL_CANFD_Global_GetRxMBIDE
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RM_IDE_STANDARD
  *           @arg @ref FL_CANFD_RM_IDE_EXTENDED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxMBIDE(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMIDb, CANFD_CFDRMID_RMIDE_Msk));
}

/**
  * @brief    Get Global RX Message Buffer RTR Bit 
  * @rmtoll   CFDRMID    RMRTR    FL_CANFD_Global_GetRxMBRTR
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RM_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_RM_RTR_REMOTE_FRAME
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxMBRTR(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMIDb, CANFD_CFDRMID_RMRTR_Msk));
}

/**
  * @brief    Get Global RX Message Buffer ID Field 
  * @rmtoll   CFDRMID    RMID    FL_CANFD_Global_ReadRxMBID
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxMBID(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMIDb, (0x1fffffffU << 0U)) >> 0U);
}

/**
  * @brief    Get Global RX Message Buffer DLC Field 
  * @rmtoll   CFDRMPTR    RMDLC    FL_CANFD_Global_ReadRxMBDLC
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxMBDLC(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMPTRb, (0xfU << 28U)) >> 28U);
}

/**
  * @brief    Get Global RX Message Buffer Timestamp Field 
  * @rmtoll   CFDRMPTR    RMTS    FL_CANFD_Global_ReadRxMBTimestamp
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxMBTimestamp(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMPTRb, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get Global RX Message Buffer Pointer Field 
  * @rmtoll   CFDRMFDSTS    RMPTR    FL_CANFD_Global_ReadRxMBPointer
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxMBPointer(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMFDSTSb, (0xffffU << 16U)) >> 16U);
}

/**
  * @brief    Get Global RX Message Buffer Information label  Field 
  * @rmtoll   CFDRMFDSTS    RMIFL    FL_CANFD_Global_ReadRxMBInfoLabel
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxMBInfoLabel(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(RM(CANFDx, rxmbX).CFDRMFDSTSb, (0x3U << 8U)) >> 8U);
}

